
export const adminConfig = {
    sidebarItems: {
        dashboard: {
            title: "لوحة التحكم",
            icon: "fa-solid fa-chart-pie",
            name: "",
        },
        categories: {
            title: "التصنيفات",
            icon: "fa-solid fa-list",
            name: "categories",
        },
        meals: {
            title: "الوجبات",
            icon: "fa-solid fa-utensils",
            name: "meals",
        },
        orders: {
            title: "الطلبات",
            icon: "fa-regular fa-clock",
            name: "orders",
        },
        admins: {
            title: "المديرين",
            icon: "fa-solid fa-shield",
            name: "admins",
        },
        users: {
            title: "المستخدمين",
            icon: "fa-solid fa-user",
            name: "users",
        },
        websiteSettings: {
            title: "إعدادات الموقع",
            icon: "fa-solid fa-wand-magic-sparkles",
            name: "website-settings",
        },
        clientPage: {
            title: "الصفحة الرئيسية",
            icon: "fa-solid fa-house",
            name: "/",
            link: "/",
            newPage: true,
        },

    },
    homepageCards: [
        {
            title: "عدد المستخدمين",
            icon: "fa-solid fa-user",
            ref: "users",
        },
        {
            title: "عدد المديرين",
            icon: "fa-solid fa-shield",
            ref: "admins",
        },
        {
            title: "عدد الخدمات",
            icon: "fa-solid fa-stethoscope",
            ref: "Meals",
        },
        {
            title: "عدد الطلبات",
            icon: "fa-regular fa-clock",
            ref: "orders",
        },

    ],
    supportedImages: [
        'image/png',
        'image/jpeg',
        'image/jpg',
    ],
    guides: {
        mealPage: {
            title: "عرض بيانات وجبة",
            description: `
            تعتبر هذه الصفحة جزءًا مهمًا من نظام إدارة المطعم حيث يتم عرض جميع البيانات المتعلقة بوجبة معينة في المطعم. تتضمن هذه البيانات معلومات مفصلة عن الوجبة مثل اسمها، وصفها، وسعرها، والمكونات المستخدمة في تحضيرها. بالإضافة إلى ذلك، قد تشمل الصفحة صورة للوجبة لجذب الانتباه وتوضيح المظهر العام للطعام. يمكن للمستخدمين الاطلاع على تقييمات الوجبة إذا كانت متوفرة، والتي قد تساعدهم في اتخاذ قرارات حول طلب الوجبة. بالإضافة إلى ذلك، يمكن لمسؤولي المطعم تحرير بيانات الوجبة مثل تحديث السعر أو تغيير وصف الوجبة إذا لزم الأمر. توفر هذه الصفحة واجهة مستخدم بسيطة ومرتبة لعرض جميع البيانات المتعلقة بوجبة معينة بشكل متكامل وسهل الوصول.
            `,
        },
        mealsPage: {
            title: "عرض جميع الوجبات",
            description: `
            تعتبر هذه الصفحة من الصفحات الأساسية في نظام إدارة المطعم حيث يتم عرض جميع الأطعمة المتاحة في قائمة المطعم بشكل شامل ومنظم. يتم تصنيف الأطعمة وفقًا لفئات مختلفة مثل المقبلات، الأطباق الرئيسية، الحلويات، والمشروبات، مما يسهل على الزبائن العثور على ما يرغبون في تناوله. يتم عرض كل عنصر من الأطعمة بمعلوماته الأساسية مثل الاسم والوصف والسعر، وغالبًا ما يتم إرفاق صورة للطعام لجذب الانتباه وتعزيز الشهية. بفضل هذه الصفحة، يمكن للمستخدمين تصفح القائمة بسهولة واختيار الأطعمة التي يرغبون في تناولها، كما يمكن للمسؤولين تحديث وإدارة الأطعمة بشكل مستمر من خلال هذه الصفحة، مما يجعلها أداة أساسية لتسهيل عملية تشغيل المطعم بشكل فعال وسلس.
            `,
        },
        websiteSettings: {
            title: `
            تعديل اعدادات الموقع
            `,
            description: `
            هذه الصفحة توفر للمستخدم واجهة لتعديل الإعدادات المتعلقة بالموقع الإلكتروني للمطعم. يمكن للمستخدم تخصيص العديد من الخيارات هنا، مثل تغيير اللغة، وتحديد التوقيت الزمني، وتغيير العنوان ومعلومات الاتصال، وتحميل الشعارات والصور الخاصة بالمطعم. بفضل هذه الصفحة، يمكن للمستخدم تخصيص الموقع بشكل يتناسب مع احتياجات المطعم وأسلوبه الفريد. لتعديل الإعدادات، يجب على المستخدم ببساطة النقر على الخيار المطلوب للتعديل، ومن ثم إدخال القيم الجديدة أو تحديثها حسب الحاجة، متبوعًا بحفظ التغييرات لتطبيقها على الموقع الإلكتروني. توفر هذه الصفحة واجهة مستخدم بسيطة وسهلة الاستخدام لتخصيص الموقع بشكل فعال وفقًا لاحتياجات المطعم وتفضيلاته.
            `,
        },
        categories: {
            title: `
                تصنيفات الوجبات
            `,
            description: `
            هذه الصفحة تعرض قائمة بجميع الفئات المتوفرة في قائمة المطعم، مما يسهل على المستخدم العثور على الأصناف بشكل منظم وسريع. يمكن للمستخدم استعراض الفئات المختلفة مثل المقبلات، الأطباق الرئيسية، الحلويات، والمشروبات. ببساطة، قم بالتنقل بين الفئات باستخدام القوائم المنسدلة أو الأزرار المخصصة لتصفح القائمة، وحدد الفئة المناسبة لعرض الأصناف المتعلقة بها.
            `,
        },
        categoryPage: {
            title: `
            عرض تصنيف
            `,
            description: `
            هذه الصفحة توفر للمستخدم إمكانية عرض جميع البيانات المتعلقة بتصنيف محدد من الأصناف في قائمة المطعم. يمكن للمستخدم استعراض قائمة كاملة بالأطباق والعناصر المصنفة تحت هذا التصنيف، بما في ذلك الأسماء، الأسعار، ووصف كل عنصر. بالإضافة إلى ذلك، يمكن للمستخدم إجراء التعديلات اللازمة مثل تعديل الأسعار أو إضافة أو حذف العناصر. للاطلاع على بيانات تصنيف معين، اختر التصنيف المطلوب من القائمة المنسدلة أو ابحث عنه، وسيتم عرض جميع البيانات المتعلقة بهذا التصنيف بشكل مرتب ومنظم لسهولة الوصول والاستخدام.
            `,
        },
        userPage: {
            title: `
            عرض بيانات مستخدم
            `,
            description: `
            هذه الصفحة تسمح للمستخدم بعرض جميع البيانات المتعلقة بمستخدم محدد في نظام إدارة المطعم. تتضمن هذه البيانات معلومات الاتصال مثل الاسم، البريد الإلكتروني، ورقم الهاتف، بالإضافة إلى أي معلومات إضافية مثل الصلاحيات والمواعيد الخاصة بالمستخدم. يمكن للمستخدم استعراض هذه البيانات للتحقق من تفاصيل الحساب والتأكد من صحتها، كما يمكنه إجراء التعديلات الضرورية مثل تحديث معلومات الاتصال أو تغيير كلمة المرور. للوصول إلى بيانات مستخدم معين، يجب على المستخدم تحديد المستخدم المناسب من القائمة أو البحث عنه باستخدام الاسم أو رقم الهاتف، وسيتم عرض جميع البيانات ذات الصلة لهذا المستخدم بشكل واضح ومرتب.
            `,
        },
        addCategoryPage: {
            title: `
            اضافة تصنيف جديد
            `,
            description: `
            تعتبر هذه الصفحة مكانًا حيث يمكن لمالك المطعم أو المسؤولين عن النظام إضافة تصنيف جديد إلى قائمة المطعم. يتيح هذا الإجراء تنظيم القائمة بشكل أفضل وتسهيل عملية البحث والتصفح للعملاء. عند الوصول إلى هذه الصفحة، يتعين على المستخدم تقديم معلومات أساسية حول التصنيف الجديد مثل اسمه ووصفه. بعد ذلك، يمكن للمستخدم اختيار الصورة المناسبة للتصنيف لتعزيز الجاذبية البصرية للقائمة. بعد إدخال وتحديد كافة التفاصيل، يمكن للمستخدم الضغط على زر "إضافة تصنيف" لتثبيت التغييرات وجعل التصنيف الجديد متاحًا للعرض على موقع المطعم الإلكتروني. توفر هذه الصفحة واجهة بسيطة وسهلة الاستخدام لتمكين المستخدم من إضافة تصنيفات جديدة بسرعة وفعالية.
            `,
        },
    }
};