export const webConfig = {
    orderStages: [
        {
            state: "pending",
            name: "قيد الانتظار",
            icon: "fa-solid fa-hourglass-start",
            description: "الطلب قد تم استلامه بنجاح، ولكنه لم يتم بدء تحضيره بعد. في هذه المرحلة، يتم مراجعة التفاصيل والمنتجات المطلوبة، وترتيب الطلب في قائمة الانتظار للطهاة. يُرجى الانتظار بضع دقائق حتى يتم بدء تحضير طلبك. سيتم إشعارك بمجرد بدء عملية التحضير، ويُرجى توخي الصبر والانتظار للحظات القليلة القادمة.",

        },
        {
            state: "cooking",
            name: "جاري التحضير",
            icon: "fa-solid fa-mortar-pestle",

            description: "في هذه المرحلة، يتم إعداد وتحضير الطلب بعناية في المطبخ. يعمل الطهاة على تجهيز الوجبة وتنسيقها وفقاً لتفاصيل الطلب المحددة. يُرجى الانتظار لبضع دقائق حتى يكتمل عملية التحضير. سيتم إشعارك بمجرد الانتهاء من التحضير، ويُرجى تحضير نفسك لاستلام طلبك بعد اكتماله.",
        },
        {
            state: "onway",
            name: "في الطريق",
            icon: "fa-solid fa-truck",
            description: " الطلب تم إعداده وجاهز للتسليم، والسائق متجه الآن لتوصيله إليك. يرجى توقع وصول الطلب في غضون الفترة المحددة عند الطلب. نحن نهتم بسلامة وجودة طلبك أثناء النقل، لذا يرجى التأكد من استقباله بسرور عند وصول السائق.",
        },
        {
            state: "delivered",
            name: "تمت بنجاح",
            icon: "fa-solid fa-check",
            description: "تم توصيل الطلب بنجاح إلى العنوان المحدد. نأمل أن يكون الطلب مرضيًا ويفي بتوقعاتك. شكرًا لاختيارك لنا، ونتطلع إلى خدمتك مرة أخرى قريبًا.",
        },
    ],
    refusedStages: [
        {
            state: "pending",
            name: "بالانتظار",
            icon: "fa-solid fa-hourglass-start",
            description: "الطلب قيد المراجعة. يتم في هذه المرحلة التحقق من جدية الطلب والعنوان قبل القبول. يُطلب من العملاء الانتظار لتلقي تحديثات حول حالة الطلب وتأكيده.",
        },
        {
            state: "refused",
            name: "تم الرفض",
            icon: "fa-solid fa-xmark",
            description: "تم رفض الطلب من قبل المطعم.",
        },
    ],
    canceledStages: [
        {
            state: "pending",
            name: "بالانتظار",
            icon: "fa-solid fa-hourglass-start",
            description: "الطلب قيد المراجعة. يتم في هذه المرحلة التحقق من جدية الطلب والعنوان قبل القبول. يُطلب من العملاء الانتظار لتلقي تحديثات حول حالة الطلب وتأكيده.",
        },
        {
            state: "canceled",
            name: "تم الالغاء",
            icon: "fa-solid fa-xmark",
            description: "تم إلغاء الطلب بواسطة العميل.",
        },
    ],
    maxItemsPerPage: 10,
}